; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob68) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear crate6)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 308)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 298)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 6)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 70)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 73)
	(at crate3 distributor0)
	(on crate3 crate0)
	(= (weight crate3) 81)
	(at crate4 distributor0)
	(on crate4 crate3)
	(= (weight crate4) 84)
	(at crate5 distributor1)
	(on crate5 crate2)
	(= (weight crate5) 83)
	(at crate6 distributor1)
	(on crate6 crate5)
	(= (weight crate6) 37)
	(at crate7 distributor0)
	(on crate7 crate4)
	(= (weight crate7) 37)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate7)
		(on crate2 crate4)
		(on crate3 pallet0)
		(on crate4 pallet1)
		(on crate5 crate6)
		(on crate6 pallet2)
		(on crate7 crate3)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate5)
   added: (lifting hoist2 crate6) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 37
   goals met: 0 of 7
3. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 7
4. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 7
5. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 70
   goals met: 0 of 7
6. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 37 to 120
   goals met: 0 of 7
7. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 3 to 4
   goals met: 0 of 7
8. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 120 to 193
   goals met: 0 of 7
9. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 193 to 156
   goals met: 0 of 7
10. (drop hoist2 crate6 pallet2 distributor1)
   deleted: (lifting hoist2 crate6) (clear pallet2)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 pallet2)
   goals met: 1 of 7
11. (unload hoist2 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 156 to 73
   goals met: 1 of 7
12. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 4 to 14
   goals met: 1 of 7
13. (drop hoist2 crate5 crate6 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate6)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate6)
   goals met: 2 of 7
14. (lift hoist1 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate4)
   added: (lifting hoist1 crate7) (clear crate4)
   changed: (fuel-cost) from 14 to 15
   goals met: 2 of 7
15. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 73 to 110
   goals met: 2 of 7
16. (lift hoist1 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   changed: (fuel-cost) from 15 to 16
   goals met: 2 of 7
17. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 110 to 194
   goals met: 2 of 7
18. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 194 to 157
   goals met: 2 of 7
19. (drop hoist1 crate7 crate3 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate3)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate3)
   goals met: 3 of 7
20. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 157 to 73
   goals met: 3 of 7
21. (drop hoist1 crate4 crate7 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate7)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate7)
   goals met: 3 of 7
22. (lift hoist1 crate4 crate7 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate7)
   added: (lifting hoist1 crate4) (clear crate7)
   changed: (fuel-cost) from 16 to 17
   goals met: 3 of 7
23. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 73 to 157
   goals met: 3 of 7
24. (lift hoist1 crate7 crate3 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate3)
   added: (lifting hoist1 crate7) (clear crate3)
   changed: (fuel-cost) from 17 to 18
   goals met: 2 of 7
25. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 157 to 194
   goals met: 2 of 7
26. (lift hoist1 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate0)
   added: (lifting hoist1 crate3) (clear crate0)
   changed: (fuel-cost) from 18 to 19
   goals met: 2 of 7
27. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 194 to 275
   goals met: 2 of 7
28. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 19 to 20
   goals met: 2 of 7
29. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 275 to 281
   goals met: 2 of 7
30. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 281 to 197
   goals met: 2 of 7
31. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 20 to 30
   goals met: 2 of 7
32. (drop hoist1 crate4 pallet1 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 pallet1)
   goals met: 3 of 7
33. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 197 to 116
   goals met: 3 of 7
34. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 4 of 7
35. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 116 to 79
   goals met: 4 of 7
36. (drop hoist0 crate7 crate3 depot0)
   deleted: (lifting hoist0 crate7) (clear crate3)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate3)
   goals met: 5 of 7
37. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 79 to 73
   goals met: 5 of 7
38. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 30 to 40
   goals met: 5 of 7
39. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 73 to 0
   goals met: 5 of 7
40. (drop hoist0 crate0 crate7 depot0)
   deleted: (lifting hoist0 crate0) (clear crate7)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate7)
   goals met: 6 of 7
41. (drop hoist1 crate2 crate4 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate4)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate4)
   goals met: 7 of 7
